#+TITLE: Plan for Analytics Dashboard
#+AUTHOR: VLEAD
#+DATE: [2017-09-12 Tue]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  - This document explains the realization plan for
    implementing =analytics-dashboard= using =feedback
    analytics= data.

* Plan ([[https://github.com/vlead/analytics-dashboard/milestone/2][Milestone]])
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone2
  :END: 
  Once this milestone is realized, the following are done to
  the Analytics Dashboard:
  1. The total number of feedbacks can be displayed.
  2. Year wise graphs can be displayed dynamically.
  3. Visualize feedback responses of particular year w.r.t
     labs, experiments and generic feedbacks can be
     dynamically done.
  4. Visualize feedback responses w.r.t Open-edx Lab, Non
     Open-edx Lab, Open-edx Experiment, Non Open-edx
     Experiment and generic feedbacks can be dynamically
     done.
  5. Transition of graphs and arrange them properly in a
     single page can be done.

#+caption:  realization-plan
#+name: tbl-realization-plan
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    S. | Tasks                | Github | Expected | Actual |  Estimated |     Actual | Status   | Assignee  |
|    NO |                      | Issues |   Effort | Effort |     Start, |     Start, |          |           |
|       |                      |        |      (in | (in    |        End |        End |          |           |
|       |                      |        |   person | person |      Dates |      Dates |          |           |
|       |                      |        |   hours) | hours) |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    1. | Display total        | [[https://github.com/vlead/analytics-dashboard/issues/22][#22]]    |       12 | 12     | 27-08-2017 | 27-08-2017 | Done     | Mrudhvika |
|       | number of feedbacks  |        |          |        | 28-08-2017 | 28-08-2017 |          |           |
|       | on the top           |        |          |        |            |            |          |           |
|       |                      |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    2. | Dynamically display  | [[https://github.com/vlead/analytics-dashboard/issues/23][#23]]    |       32 | 36     | 21-07-2017 | 21-07-2017 | Done     | Mrudhvika |
|       | feedbacks yearly     |        |          |        | 24-07-2017 | 25-07-2017 |          | Reena     |
|       | wise                 |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    3. | Display feedbacks of | [[https://github.com/vlead/analytics-dashboard/issues/24][#24]]    |       27 | 32     | 29-08-2017 | 29-08-2017 | Done     | Reena     |
|       | a particular year    |        |          |        | 31-08-2017 | 01-09-2017 |          |           |
|       | on the basis of lab, |        |          |        |            |            |          |           |
|       | exp and generic      |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    4. | Present feedbacks in | [[https://github.com/vlead/analytics-dashboard/issues/25][#25]]    |       40 |        | 06-09-2017 |            | In       | Reena     |
|       | further detail       |        |          |        | 13-09-2017 |            | Progress |           |
|       | depends on OL, NOL,  |        |          |        |            |            |          |           |
|       | OE, NOE and generic  |        |          |        |            |            |          |           |
|       |                      |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
|    5. | Transisions of all   | [[https://github.com/vlead/analytics-dashboard/issues/26][#26]]    |       10 |        | 14-09-2017 |            | Backlog  | Reena     |
|       | the graphs and       |        |          |        | 15-09-2017 |            |          |           |
|       | arrange them         |        |          |        |            |            |          |           |
|       | properly in a page   |        |          |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
| Total |                      |        |      121 |        |            |            |          |           |
|     ^ |                      |        |    total |        |            |            |          |           |
|-------+----------------------+--------+----------+--------+------------+------------+----------+-----------|
#+TBLFM: $total=vsum(@II+1..@-1)
